results/ryzen9-7950x-node0/e2e-v2/runs/q-h2-arena-direct/h2load.txt
starting benchmark...
spawning thread #0: 4 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #1: 4 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #2: 4 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #3: 4 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
Warm-up started for thread #0.
Warm-up started for thread #Warm-up started for thread #3.
Warm-up started for thread #1.
2.
progress: 25% of clients started
progress: 50% of clients started
progress: 75% of clients started
progress: 100% of clients started
Warm-up phase is over for thread #1.
Warm-up phase is over for thread #Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
2Application protocol: h2c
.
Main benchmark duration is started for thread #2.
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #2. Stopping all clients.
Main benchmark duration is over for thread #3. Stopping all clients.
Main benchmark duration is over for thread #Stopped all clients for thread #3
Stopped all clients for thread #2
0. Stopping all clients.
Stopped all clients for thread #0

finished in 20.00s, 670188.00 req/s, 2.26GB/s
requests: 13403760 total, 13404272 started, 13403760 done, 13403760 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 13403760 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 45.21GB (48547832074) total, 12.78MB (13403760) headers (space savings 90.00%), 44.74GB (48040874160) data
                     min         max         mean         sd        +/- sd
time for request:      309us     76.76ms       710us       818us    99.30%
time for connect:        8us        84us        41us        25us    56.25%
time to 1st byte:    63.32ms     69.09ms     66.09ms      2.66ms    50.00%
req/s           :   41606.49    42178.47    41886.52      205.97    50.00%